{
  "_name_or_path": "LAM-base-v1",
  "architectures": [
    "LAMModel"
  ],
  "attention_probs_dropout_prob": 0.1,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 384,
  "initializer_range": 0.02,
  "intermediate_size": 1536,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 32768,
  "model_type": "lam",
  "num_attention_heads": 12,
  "num_hidden_layers": 6,
  "num_heads": 12,
  "num_layers": 6,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.30.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522,
  "lam_config": {
    "fast_decay_init": 0.3,
    "slow_decay_init": 0.85,
    "use_hierarchical_decay": true,
    "use_enhanced_flux": true,
    "complexity": "O(n)",
    "memory_type": "dual_state"
  },
  "version": "1.0.0"
}
